hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.h
    Error codes that may be returned with @ref NRF_DRV_USBD_EVT_EPTRANSFER
*/
typedef enum
{
    NRF_USBD_EP_OK,       /**< No error */
    NRF_USBD_EP_WAITING,  /**< Data received, no buffer prepared already - waiting for configured transfer */
    NRF_USBD_EP_OVERLOAD, /**< Received number of bytes cannot fit given buffer
                               This error would also be returned when next_transfer function has been defined
                               but currently received data cannot fit completely in current buffer.
                               No data split from single endpoint transmission is supported.

                               When this error is reported - data is left inside endpoint buffer.
                               Clear endpoint or prepare new buffer and read it.
*/
    NRF_USBD_EP_ABORTED,  /**< EP0 transfer can be aborted when new setup comes.
                               Any other transfer can be aborted by USB reset or library stopping.
*/
} nrf_drv_usbd_ep_status_t;


/**
    @brief Event structure

    Structure passed to event handler
*/
typedef struct
{
    nrf_drv_usbd_event_type_t type;
    union
    {
        struct
        {
            uint16_t framecnt; //!< Current value of frame counter
        } sof; //!< Data aviable for @ref NRF_DRV_USBD_EVT_SOF
        struct
        {
            nrf_drv_usbd_ep_t        ep;     //!< Endpoint number
        } isocrc;
        struct
        {
            nrf_drv_usbd_ep_t        ep;     //!< Endpoint number
            nrf_drv_usbd_ep_status_t status; //!< Status for the endpoint
        } eptransfer;
    } data;
} nrf_drv_usbd_evt_t;

/**
    @brief USBD event callback function type.

    @param[in] p_event Event information structure.
*/
typedef void (*nrf_drv_usbd_event_handler_t)(nrf_drv_usbd_evt_t const *const p_event);

/**
    @brief Universal data pointer.

    Universal data pointer that can be used for any type of transfer.
*/
typedef union
{
    void const *tx;  //!< Constant TX buffer pointer.
    void *rx;        //!< Writable RX buffer pointer.
    uint32_t ptr;    //!< Numeric value used internally by the library.
} nrf_drv_usbd_data_ptr_t;

/**
    @brief Structure to be filled with information about the next transfer.

    This is used mainly for transfer feeders and consumers.
    It describes a single endpoint transfer and therefore the size of the buffer
    can never be higher than the endpoint size.
*/
typedef struct
{
    nrf_drv_usbd_data_ptr_t p_data; //!< Union with available data pointers used by the library.
    size_t size;                    //!< Size of the requested transfer.
} nrf_drv_usbd_ep_transfer_t;

/**
    @brief Flags for the current transfer.

    Flags configured for the transfer that can be merged using the bitwise 'or' operator (|).
*/
typedef enum
{
    NRF_DRV_USBD_TRANSFER_ZLP_FLAG = 1U << 0, //!< Add a zero-length packet.
} nrf_drv_usbd_transfer_flags_t;

/**
    @brief Total transfer configuration.

    This structure is used to configure total transfer information.
    It is used by internal built-in feeders and consumers.
*/
typedef struct
{
    nrf_drv_usbd_data_ptr_t p_data; //!< Union with available data pointers used by the library.
    size_t size;                    //!< Total size of the requested transfer.
    uint32_t flags;                 //!< Transfer flags.
    /**< Use the @ref nrf_drv_usbd_transfer_flags_t values. */
} nrf_drv_usbd_transfer_t;


/**
    @brief Auxiliary macro for declaring IN transfer description with flags.

    The base macro for creating transfers with any configuration option.

    @param name     Instance name.
    @param tx_buff  Buffer to transfer.
    @param tx_size  Transfer size.
    @param tx_flags Flags for the transfer (see @ref nrf_drv_usbd_transfer_flags_t).

    @return Configured variable with total transfer description.
*/
#define NRF_DRV_USBD_TRANSFER_IN_FLAGS(name, tx_buff, tx_size, tx_flags) \
    const nrf_drv_usbd_transfer_t name = {                               \
                                                                         .p_data = { .tx = (tx_buff)  },                                   \
                                                                         .size = (tx_size),                                                \
                                                                         .flags = (tx_flags)                                               \
                                         }

/**
    @brief Helper macro for declaring IN transfer description

    Normal transfer mode, no ZLP would be automatically generated.

    @sa nrf_drv_usbd_transfer_t
    @sa NRF_DRV_USBD_TRANSFER_IN_ZLP

    @param name    Instance name
    @param tx_buff Buffer to transfer
    @param tx_size Transfer size

    @return Configured variable with total transfer description

*/
#define NRF_DRV_USBD_TRANSFER_IN(name, tx_buff, tx_size) \
    NRF_DRV_USBD_TRANSFER_IN_FLAGS(name, tx_buff, tx_size, 0)

/**
    @brief Helper macro for declaring IN transfer description

    ZLP mode - Zero Length Packet would be generated on the end of the transfer
    (always!).

    @sa nrf_drv_usbd_transfer_t
    @sa NRF_DRV_USBD_TRANSFER_IN

    @param name    Instance name
    @param tx_buff Buffer to transfer
    @param tx_size Transfer size

    @return Configured variable with total transfer description
*/
#define NRF_DRV_USBD_TRANSFER_IN_ZLP(name, tx_buff, tx_size) \
    NRF_DRV_USBD_TRANSFER_IN_FLAGS(                          \
                                                             name,                                                \
                                                             tx_buff,                                             \
                                                             tx_size,                                             \
                                                             NRF_DRV_USBD_TRANSFER_ZLP_FLAG)

/**
    @brief Helper macro for declaring OUT transfer item (@ref nrf_drv_usbd_transfer_t)

    @param name    Instance name
    @param rx_buff Buffer to transfer
    @param rx_size Transfer size
 * */
#define NRF_DRV_USBD_TRANSFER_OUT(name, rx_buff, rx_size)       \
    const nrf_drv_usbd_transfer_t name = {                      \
                                                                .p_data = { .rx = (rx_buff)  },                          \
                                                                .size = (rx_size),                                       \
                                                                .flags = 0                                               \
                                         }

/**
    @brief USBD transfer feeder.

