hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.h
    Pointer for a transfer feeder.
    Transfer feeder is a feedback function used to prepare a single
    TX (Device->Host) endpoint transfer.

    The transfers provided by the feeder must be simple:
    - The size of the transfer provided by this function is limited to a single endpoint buffer.
     Bigger transfers are not handled automatically in this case.
    - Flash transfers are not automatically supported- you must copy them to the RAM buffer before.

    @note
    This function may use @ref nrf_drv_usbd_feeder_buffer_get to gain a temporary buffer
    that can be used to prepare transfer.

    @param[out]    p_next    Structure with the data for the next transfer to be filled.
                            Required only if the function returns true.
    @param[in,out] p_context Context variable configured with the transfer.
    @param[in]     ep_size   The endpoint size.

    @retval false The current transfer is the last one - you do not need to call
                 the function again.
    @retval true  There is more data to be prepared and when the current transfer
                 finishes, the feeder function is expected to be called again.
*/
typedef bool (*nrf_drv_usbd_feeder_t)(
    nrf_drv_usbd_ep_transfer_t *p_next,
    void *p_context,
    size_t ep_size);
    
/**
    @brief USBD transfer consumer.

    Pointer for a transfer consumer.
    Transfer consumer is a feedback function used to prepare a single
    RX (Host->Device) endpoint transfer.

    The transfer must provide a buffer big enough to fit the whole data from the endpoint.
    Otherwise, the NRF_USBD_EP_OVERLOAD event is generated.

    @param[out]    p_next    Structure with the data for the next transfer to be filled.
                            Required only if the function returns true.
    @param[in,out] p_context Context variable configured with the transfer.
    @param[in]     ep_size   The endpoint size.
    @param[in]     data_size Number of received bytes in the endpoint buffer.

    @retval false Current transfer is the last one - you do not need to call
                 the function again.
    @retval true  There is more data to be prepared and when current transfer
                 finishes, the feeder function is expected to be called again.
*/
typedef bool (*nrf_drv_usbd_consumer_t)(
    nrf_drv_usbd_ep_transfer_t *p_next,
    void *p_context,
    size_t ep_size,
    size_t data_size);
    
/**
    @brief Universal transfer handler.

    Union with feeder and consumer function pointer.
*/
typedef union
{
    nrf_drv_usbd_feeder_t   feeder;   //!< Feeder function pointer.
    nrf_drv_usbd_consumer_t consumer; //!< Consumer function pointer.
} nrf_drv_usbd_handler_t;

/**
    @brief USBD transfer descriptor.

    Universal structure that may hold the setup for callback configuration for
    IN or OUT type of the transfer.
*/
typedef struct
{
    nrf_drv_usbd_handler_t   handler;   //!< Handler for the current transfer, function pointer.
    void                    *p_context; //!< Context for the transfer handler.
} nrf_drv_usbd_handler_desc_t;

/**
    @brief Setup packet structure

    Structure that contains interpreted SETUP packet.
*/
typedef struct
{
    uint8_t  bmRequestType; //!< byte 0
    uint8_t  bmRequest;     //!< byte 1
    uint16_t wValue;        //!< byte 2
    uint16_t wIndex;        //!< byte 4, 5
    uint16_t wLength;       //!< byte 6, 7
} nrf_drv_usbd_setup_t;

/**
    @brief Library initialization

    @param[in] event_handler Event handler provided by the user.
*/
ret_code_t nrf_drv_usbd_init(nrf_drv_usbd_event_handler_t const event_handler);

/**
    @brief Library deinitialization
*/
ret_code_t nrf_drv_usbd_uninit(void);

/**
    @brief Enable the USBD port

    After calling this function USBD peripheral would be enabled.
    The USB LDO would be enabled.
    Enabled USBD peripheral would request HFCLK.
    This function does not enable external oscillator, so if it is not enabled by other part of the
    program after enabling USBD driver HFINT would be used for the USBD peripheral.
    It is perfectly fine until USBD is started. See @ref nrf_drv_usbd_start.

    In normal situation this function should be called in reaction to USBDETECTED
    event from POWER peripheral.

    Interrupts and USB pins pull-up would stay disabled until @ref nrf_drv_usbd_start
    function is called.
*/
void nrf_drv_usbd_enable(void);

/**
    @brief Disable the USBD port

    After calling this function USBD peripheral would be disabled.
    No events would be detected or processed by the library.
    Clock for the peripheral would be disconnected.
*/
void nrf_drv_usbd_disable(void);

/**
    @brief Start USB functionality

    After calling this function USBD peripheral should be fully functional
    and all new incoming events / interrupts would be processed by the library.

    Also only after calling this function host sees new connected device.

    Call this function when USBD power LDO regulator is ready - on USBPWRRDY event
    from POWER peripheral.

    Before USBD interrupts are enabled, external HFXO is requested.

    @param enable_sof The flag that is used to enable SOF processing.
                     If it is false, SOF interrupt is left disabled and will not be generated.
                     This improves power saving if SOF is not required.

    @note If the isochronous endpoints are going to be used,
         it is required to enable the SOF.
         In other case any isochronous endpoint would stay busy
         after first transmission.
*/
void nrf_drv_usbd_start(bool enable_sof);

/**
    @brief Stop USB functionality

    This function disables USBD pull-up and interrupts.

    The HFXO request is released in this function.

    @note
    This function can also be used to logically disconnect USB from the HOST that
    would force it to enumerate device after calling @ref nrf_drv_usbd_start.
*/
void nrf_drv_usbd_stop(void);

/**
    @brief Check if driver is initialized

