hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.h
    @retval false Driver is not initialized
    @retval true Driver is initialized
*/
bool nrf_drv_usbd_is_initialized(void);

/**
    @brief Check if driver is enabled

    @retval false Driver is disabled
    @retval true  Driver is enabled
*/
bool nrf_drv_usbd_is_enabled(void);

/**
    @brief Check if driver is started

    @retval false Driver is not started
    @retval true Driver is started (fully functional)
    @note The USBD peripheral interrupt state is checked
*/
bool nrf_drv_usbd_is_started(void);

/**
    @brief Suspend USBD operation

    The USBD peripheral is forced to go into the low power mode.
    The function has to be called in the reaction to @ref NRF_DRV_USBD_EVT_SUSPEND event
    when the firmware is ready.

    After successful call of this function most of the USBD registers would be unavailable.

    @note Check returned value for the feedback if suspending was successful.

    @retval true  USBD peripheral successfully suspended
    @retval false USBD peripheral was not suspended due to resume detection.

*/
bool nrf_drv_usbd_suspend(void);

/**
    @brief Start wake up procedure

    The USBD peripheral is forced to quit the low power mode.
    After calling this function all the USBD registers would be available.

    The hardware starts measuring time when wake up is possible.
    This may take 0-5&nbsp;ms depending on how long the SUSPEND state was kept on the USB line.

    When NRF_DRV_USBD_EVT_WUREQ event is generated it means that Wake Up signaling has just been
    started on the USB lines.

    @note Do not expect only @ref NRF_DRV_USBD_EVT_WUREQ event.
         There always may appear @ref NRF_DRV_USBD_EVT_RESUME event.
    @note NRF_DRV_USBD_EVT_WUREQ event means that Remote WakeUp signal
         has just begun to be generated.
         This may take up to 20&nbsp;ms for the bus to become active.

    @retval true WakeUp procedure started.
    @retval false No WakeUp procedure started - bus is already active.
*/
bool nrf_drv_usbd_wakeup_req(void);

/**
    @brief Check if USBD is in SUSPEND mode

    @note This is the information about peripheral itself, not about the bus state.

    @retval true  USBD peripheral is suspended
    @retval false USBD peripheral is active
*/
bool nrf_drv_usbd_suspend_check(void);

/**
    @brief Enable only interrupts that should be processed in SUSPEND mode

    Auxiliary function to help with SUSPEND mode integration.
    It enables only the interrupts that can be properly processed without stable HFCLK.

    Normally all the interrupts are enabled.
    Use this function to suspend interrupt processing that may require stable HFCLK until the
    clock is enabled.

    @sa nrf_drv_usbd_active_irq_config
*/
void nrf_drv_usbd_suspend_irq_config(void);

/**
    @brief Default active interrupt configuration

    Default interrupt configuration.
    Use in a pair with @ref nrf_drv_usbd_active_irq_config.

    @sa nrf_drv_usbd_suspend_irq_config
*/
void nrf_drv_usbd_active_irq_config(void);

/**
    @brief Check the bus state

    This function checks if the bus state is suspended

    @note The value returned by this function changes on SUSPEND and RESUME event processing.

    @retval true  USBD bus is suspended
    @retval false USBD bus is active
*/
bool nrf_drv_usbd_bus_suspend_check(void);

/**
    @brief Force the bus state to active
*/
void nrf_drv_usbd_force_bus_wakeup(void);

/**
    @brief Configure packet size that should be supported by the endpoint

    The real endpoint buffer size is always the same.
    This value sets max packet size that would be transmitted over the endpoint.
    This is required by the library

    @param[in] ep   Endpoint number
    @param[in] size Required maximum packet size

    @note Endpoint size is always set to @ref NRF_DRV_USBD_EPSIZE or @ref NRF_DRV_USBD_ISOSIZE / 2
         when @ref nrf_drv_usbd_ep_enable function is called.
*/
void nrf_drv_usbd_ep_max_packet_size_set(nrf_drv_usbd_ep_t ep, uint16_t size);

/**
    @brief Get configured endpoint packet size

    Function to get configured endpoint size on the buffer.

    @param[in] ep Endpoint number

    @return Maximum pocket size configured on selected endpoint
*/
uint16_t nrf_drv_usbd_ep_max_packet_size_get(nrf_drv_usbd_ep_t ep);

/**
    @brief Check if the selected endpoint is enabled.

    @param ep Endpoint number to check.

    @retval true  Endpoint is enabled.
    @retval false Endpoint is disabled.
*/
bool nrf_drv_usbd_ep_enable_check(nrf_drv_usbd_ep_t ep);

/**
    @brief Enable selected endpoint

    This function enables endpoint itself and its interrupts.
    @param ep Endpoint number to enable

    @note
    Max packet size is set to endpoint default maximum value.

    @sa nrf_drv_usbd_ep_max_packet_size_set
*/
void nrf_drv_usbd_ep_enable(nrf_drv_usbd_ep_t ep);

/**
    @brief Disable selected endpoint

    This function disables endpoint itself and its interrupts.
    @param ep Endpoint number to disable
*/
void nrf_drv_usbd_ep_disable(nrf_drv_usbd_ep_t ep);

/**
    @brief Disable all endpoints except for EP0

    Disable all endpoints that can be disabled in USB device while it is still active.
*/
void nrf_drv_usbd_ep_default_config(void);

/**
    @brief Start sending data over endpoint

    Function initializes endpoint transmission.
    This is asynchronous function - it finishes immediately after configuration
    for transmission is prepared.

    @note Data buffer pointed by p_data have to be kept active till
         @ref NRF_DRV_USBD_EVT_EPTRANSFER event is generated.

    @param[in] ep         Endpoint number.
                         For IN endpoint sending would be initiated.
                         For OUT endpoint receiving would be initiated.
    @param[in] p_transfer

    @retval NRF_ERROR_BUSY          Selected endpoint is pending.
    @retval NRF_ERROR_INVALID_ADDR  Unexpected transfer on EPIN0 or EPOUT0.
    @retval NRF_ERROR_FORBIDDEN     Endpoint stalled.
    @retval NRF_SUCCESS             Transfer queued or started.
*/
ret_code_t nrf_drv_usbd_ep_transfer(
    nrf_drv_usbd_ep_t                                  ep,
    nrf_drv_usbd_transfer_t              const *const p_transfer);
    
/**
    @brief Start sending data over the endpoint using the transfer handler function.

