hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/drivers_nrf/usbd/nrf_drv_usbd.h
    This function initializes an endpoint transmission.
    Just before data is transmitted, the transfer handler
    is called and it prepares a data chunk.

    @param[in] ep    Endpoint number.
                    For an IN endpoint, sending is initiated.
                    For an OUT endpoint, receiving is initiated.
    @param p_handler Transfer handler - feeder for IN direction and consumer for
                    OUT direction.

    @retval NRF_ERROR_BUSY          Selected endpoint is pending.
    @retval NRF_ERROR_INVALID_ADDR  Unexpected transfer on EPIN0 or EPOUT0.
    @retval NRF_ERROR_FORBIDDEN     Endpoint stalled.
    @retval NRF_SUCCESS             Transfer queued or started.
*/
ret_code_t nrf_drv_usbd_ep_handled_transfer(
    nrf_drv_usbd_ep_t                         ep,
    nrf_drv_usbd_handler_desc_t const *const p_handler);
    
/**
    @brief Get the temporary buffer to be used by the feeder.

    This buffer is used for TX transfers and it can be reused automatically
    when the transfer is finished.
    Use it for transfer preparation.

    May be used inside the feeder configured in @ref nrf_drv_usbd_ep_handled_transfer.

    @return Pointer to the buffer that can be used temporarily.

    @sa NRF_DRV_USBD_FEEDER_BUFFER_SIZE
*/
void *nrf_drv_usbd_feeder_buffer_get(void);

/**
    @brief Get the information about last finished or current transfer

    Function returns the status of the last buffer set for transfer on selected endpoint.
    The status considers last buffer set by @ref nrf_drv_usbd_ep_transfer function or
    by transfer callback function.

    @param[in]  ep     Endpoint number.
    @param[out] p_size Information about the current/last transfer size.

    @retval NRF_SUCCESS         Transfer already finished
    @retval NRF_ERROR_BUSY      Ongoing transfer
    @retval NRF_ERROR_DATA_SIZE Too much of data received that cannot fit into buffer and cannot be splited into chunks.
                               This may happen if buffer size is not a multiplication of endpoint buffer size.
*/
ret_code_t nrf_drv_usbd_ep_status_get(nrf_drv_usbd_ep_t ep, size_t *p_size);

/**
    @brief Get number of received bytes

    Get the number of received bytes.
    The function behavior is undefined when called on IN endpoint.

    @param ep Endpoint number.

    @return Number of received bytes
*/
size_t nrf_drv_usbd_epout_size_get(nrf_drv_usbd_ep_t ep);

/**
    @brief Check if endpoint buffer is ready or is under USB IP control

    Function to test if endpoint is busy.
    Endpoint that is busy cannot be accessed by MCU.
    It means that:
    - OUT (TX) endpoint: Last uploaded data is still in endpoint and is waiting
                        to be received by the host.
    - IN  (RX) endpoint: Endpoint is ready to receive data from the host
                        and the endpoint does not have any data.
    When endpoint is not busy:
    - OUT (TX) endpoint: New data can be uploaded.
    - IN  (RX) endpoint: New data can be downloaded using @ref nrf_drv_usbd_ep_transfer
                        function.
*/
bool nrf_drv_usbd_ep_is_busy(nrf_drv_usbd_ep_t ep);

/**
    @brief Stall endpoint

    Stall endpoit to send error information during next transfer request from
    the host.

    @note To stall endpoint it is safer to use @ref nrf_drv_usbd_setup_stall
    @note Stalled endpoint would not be cleared when DMA transfer finishes.

    @param ep Endpoint number to stall

*/
void nrf_drv_usbd_ep_stall(nrf_drv_usbd_ep_t ep);

/**
    @brief Clear stall flag on endpoint

    This function clears endpoint that is stalled.
    @note
    If it is OUT endpoint (receiving) it would be also prepared for reception.
    It means that busy flag would be set.
    @note
    In endpoint (transmitting) would not be cleared - it gives possibility to
    write new data before transmitting.
*/
void nrf_drv_usbd_ep_stall_clear(nrf_drv_usbd_ep_t ep);

/**
    @brief Check if endpoint is stalled

    This function gets stall state of selected endpoint

    @param ep Endpoint number to check
*/
bool nrf_drv_usbd_ep_stall_check(nrf_drv_usbd_ep_t ep);

/**
    @brief Clear current endpoint data toggle

    @param ep Endpoint number to clear
*/
void nrf_drv_usbd_ep_dtoggle_clear(nrf_drv_usbd_ep_t ep);

/**
    @brief Get parsed setup data

    Function fills the parsed setup data structure.

    @param[out] p_setup Pointer to data structure that would be filled by
                       parsed data.
*/
void nrf_drv_usbd_setup_get(nrf_drv_usbd_setup_t *const p_setup);

/**
    @brief Clear only for data transmission on setup endpoint

    This function may be called if any more data in control write transfer is expected.
    Clears only OUT endpoint to be able to take another OUT data token.
    It does not allow STATUS stage.
    @sa nrf_drv_usbd_setup_clear
*/
void nrf_drv_usbd_setup_data_clear(void);

/**
    @brief Clear setup endpoint

    This function acknowledges setup when SETUP command was received and processed.
    It has to be called if no data respond for the SETUP command is sent.
*/
void nrf_drv_usbd_setup_clear(void);

/**
    @brief Stall setup endpoint

    Mark and error on setup endpoint.
*/
void nrf_drv_usbd_setup_stall(void);

/**
    @note
    This function locks interrupts that may be costly.
    It is good idea to test if the endpoint is still busy before calling this function:
    @code
    (m_ep_dma_waiting & (1U << ep2bit(ep)))
    @endcode
    This function would check it again, but it makes it inside critical section.
*/
void nrf_drv_usbd_ep_abort(nrf_drv_usbd_ep_t ep);

/**
    @brief Get the information about expected transfer SETUP data direction

    Function returns the information about last expected transfer direction.

    @retval NRF_DRV_USBD_EPOUT0 Expecting OUT (Host->Device) direction or no data
    @retval NRF_DRV_USBD_EPIN0  Expecting IN (Device->Host) direction
*/
nrf_drv_usbd_ep_t nrf_drv_usbd_last_setup_dir_get(void);

/**
    @brief Drop transfer on OUT endpoint

    @param[in] ep  OUT endpoint ID
*/
void nrf_drv_usbd_transfer_out_drop(nrf_drv_usbd_ep_t ep);

#ifdef __cplusplus
}
#endif

/** @} */
#endif /* NRF_DRV_USBD_H__ */
